report/stage_6/profiling/review_multihttp/wrk2_multihttp_put.txt
$ wrk2 -c 128 -t 8 -d 65s -R 20000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_multihttp_put.txt


Running 1m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.251ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.247ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.247ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.239ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.250ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.234ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.252ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.251ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  747.94us  26.00ms   74.07%
    Req/Sec     2.64k   232.36     8.11k    67.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.20ms
 75.000%    1.67ms
 90.000%    2.14ms
 99.000%    3.51ms
 99.900%    6.56ms
 99.990%   12.94ms
 99.999%   20.21ms
100.000%   26.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.046     0.000000            2         1.00
       0.455     0.100000       109902         1.11
       0.674     0.200000       220161         1.25
       0.861     0.300000       329800         1.43
       1.034     0.400000       439649         1.67
       1.201     0.500000       549358         2.00
       1.286     0.550000       604569         2.22
       1.373     0.600000       659456         2.50
       1.464     0.650000       713996         2.86
       1.563     0.700000       768973         3.33
       1.673     0.750000       824067         4.00
       1.733     0.775000       851407         4.44
       1.798     0.800000       878962         5.00
       1.868     0.825000       906339         5.71
       1.945     0.850000       933619         6.67
       2.033     0.875000       961147         8.00
       2.085     0.887500       975233         8.89
       2.139     0.900000       988658        10.00
       2.201     0.912500      1002343        11.43
       2.273     0.925000      1016161        13.33
       2.357     0.937500      1029760        16.00
       2.407     0.943750      1036679        17.78
       2.463     0.950000      1043563        20.00
       2.527     0.956250      1050326        22.86
       2.603     0.962500      1057242        26.67
       2.695     0.968750      1064109        32.00
       2.753     0.971875      1067527        35.56
       2.821     0.975000      1070999        40.00
       2.899     0.978125      1074391        45.71
       2.997     0.981250      1077790        53.33
       3.127     0.984375      1081226        64.00
       3.209     0.985938      1082953        71.11
       3.303     0.987500      1084646        80.00
       3.417     0.989062      1086349        91.43
       3.571     0.990625      1088078       106.67
       3.773     0.992188      1089796       128.00
       3.891     0.992969      1090645       142.22
       4.029     0.993750      1091506       160.00
       4.215     0.994531      1092356       182.86
       4.415     0.995313      1093226       213.33
       4.643     0.996094      1094084       256.00
       4.787     0.996484      1094516       284.44
       4.955     0.996875      1094939       320.00
       5.135     0.997266      1095363       365.71
       5.339     0.997656      1095803       426.67
       5.587     0.998047      1096223       512.00
       5.743     0.998242      1096432       568.89
       5.919     0.998437      1096650       640.00
       6.119     0.998633      1096861       731.43
       6.343     0.998828      1097075       853.33
       6.595     0.999023      1097290      1024.00
       6.743     0.999121      1097401      1137.78
       6.915     0.999219      1097506      1280.00
       7.127     0.999316      1097613      1462.86
       7.411     0.999414      1097719      1706.67
       7.767     0.999512      1097826      2048.00
       8.031     0.999561      1097881      2275.56
       8.311     0.999609      1097933      2560.00
       8.615     0.999658      1097987      2925.71
       9.191     0.999707      1098042      3413.33
       9.727     0.999756      1098096      4096.00
      10.079     0.999780      1098121      4551.11
      10.639     0.999805      1098148      5120.00
      10.999     0.999829      1098176      5851.43
      11.519     0.999854      1098202      6826.67
      12.143     0.999878      1098228      8192.00
      12.567     0.999890      1098242      9102.22
      13.087     0.999902      1098255     10240.00
      13.623     0.999915      1098269     11702.86
      14.175     0.999927      1098282     13653.33
      14.879     0.999939      1098295     16384.00
      15.391     0.999945      1098303     18204.44
      15.695     0.999951      1098309     20480.00
      16.023     0.999957      1098316     23405.71
      16.703     0.999963      1098322     27306.67
      17.695     0.999969      1098329     32768.00
      17.967     0.999973      1098332     36408.89
      18.575     0.999976      1098336     40960.00
      18.655     0.999979      1098339     46811.43
      19.183     0.999982      1098342     54613.33
      19.727     0.999985      1098346     65536.00
      19.919     0.999986      1098347     72817.78
      20.015     0.999988      1098349     81920.00
      20.207     0.999989      1098351     93622.86
      20.271     0.999991      1098352    109226.67
      20.607     0.999992      1098354    131072.00
      21.007     0.999993      1098355    145635.56
      21.375     0.999994      1098356    163840.00
      22.575     0.999995      1098357    187245.71
      22.575     0.999995      1098357    218453.33
      22.655     0.999996      1098358    262144.00
      23.839     0.999997      1098359    291271.11
      23.839     0.999997      1098359    327680.00
      25.327     0.999997      1098360    374491.43
      25.327     0.999998      1098360    436906.67
      25.327     0.999998      1098360    524288.00
      25.807     0.999998      1098361    582542.22
      25.807     0.999998      1098361    655360.00
      25.807     0.999999      1098361    748982.86
      25.807     0.999999      1098361    873813.33
      25.807     0.999999      1098361   1048576.00
      26.015     0.999999      1098362   1165084.44
      26.015     1.000000      1098362          inf
#[Mean    =        1.284, StdDeviation   =        0.748]
#[Max     =       26.000, Total count    =      1098362]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1299247 requests in 1.08m, 101.43MB read
  Non-2xx or 3xx responses: 665898
Requests/sec:  19989.36
Transfer/sec:      1.56MB